{
	"Description" : "Scans the specified area of a substrate at low zoom in order to determine regions of interest. Zooms into these regions of interest, refines the focus of the camera and takes multiple images and averages them together to produce high quality images of areas of the substrate that contain flakes.",
	"arguments" : [
		{
			"names" : ["-o", "--output"],
			"spec"  : {
				"dest"     : "output_directory",
				"type"     : "str",
				"required" : true,
				"help"     : "The directory to write output files to. It will be created if it does not exist. This program will not write into a folder that is not empty."
			}
		},
		{
			"names" : ["-b", "--bounds"],
			"spec"  : {
				"dest"     : "bounds",
				"nargs"    : 4,
				"type"     : "float",
				"required" : true,
				"help"     : "The stage coordinates to scan over. The format is 'x_min x_max y_min y_max'"
			}
		},
		{
			"names" : ["-F", "--focus-points"],
			"spec"  : {
				"dest"     : "bounds",
				"nargs"    : "*",
				"type"     : "float",
				"default"  : null,
				"help"     : "A list of coordinates in the sample to autofocus on before performing the scan. These points are used to fit the focus as a function of coordinates to a plane. This plane is then interpolated over to adjust the focus when taking images."
			}
		},
		{
			"names" : ["-e", "--exposure"],
			"spec"  : {
				"dest"     : "exposure",
				"type"     : "float",
				"required" : true,
				"help"     : "The exposure time to use during the scan in milliseconds."
			}
		},
		{
			"names" : ["-f", "--fine-zoom"],
			"spec"  : {
				"dest"     : "fine_zoom",
				"nargs"    : 4,
				"type"     : "float",
				"required" : true,
				"help"     : "The zoom to use when taking high quality images of interesting areas. The height and width of an image in real coordinates is also needed. The format for this argument is 'zoom image_width image_height exposure'. Zoom is real number between 0 and 1 where 0 is the lowest zoom and 1 is the highest zoom. width and height are in millimeters. Exposure is in milliseconds."
			}
		},
		{
			"names" : ["-fa", "--fine-averages"],
			"spec"  : {
				"dest"     : "fine_averages",
				"type"     : "int",
				"default"  : 6,
				"help"     : "The number of images to average together when taking zoomed in images."
			}
		},
		{
			"names" : ["-c", "--coarse-zoom"],
			"spec"  : {
				"dest"     : "coarse_zoom",
				"nargs"    : 4,
				"type"     : "float",
				"required" : true,
				"help"     : "The zoom to use when taking low quality images to find interesting areas. The height and width of an image in real coordinates is also needed. The format for this argument is 'zoom image_width image_height exposure'. Zoom is real number between 0 and 1 where 0 is the lowest zoom and 1 is the highest zoom. width and height are in millimeters. Exposure is in milliseconds."
			}
		},
		{
			"names" : ["-ca", "--coarse-averages"],
			"spec"  : {
				"dest"     : "coarse_averages",
				"type"     : "int",
				"default"  : 6,
				"help"     : "The number of images to average together when taking zoomed out images."
			}
		},
		{
			"names" : ["-cd", "--coarse-downscale"],
			"spec"  : {
				"dest"     : "coarse_downscale",
				"type"     : "int",
				"default"  : 2,
				"help"     : "The factor to downscale coarse images by before processing. This improves performance."
			}
		},
		{
			"names" : ["-fr", "--focus-range"],
			"spec"  : {
				"dest"     : "focus_range",
				"nargs"    : 2,
				"type"     : "float",
				"default"  : [0.45, 0.55],
				"required" : true,
				"help"     : "The range of values to sweep when focusing the camera. This can often be the current focal point +/- 0.05. Only very uneven or very large samples will have their focal points vary by more than that."
			}
		},
		{
			"names" : ["-qf", "--quality-focus"],
			"spec"  : {
				"dest"     : "quality_focus",
				"action"   : "store_true",
				"help"     : "Perform a more careful movement of the focus lens when refocusing the camera for each image. This is VERY expensive in terms of time, but it may improve image quality if the focus motor is misbehaving."
			}
		},
		{
			"names" : ["-nc", "--negative-contrast"],
			"spec"  : {
				"dest"     : "negative_contrast",
				"action"   : "store_true",
				"help"     : "The contrast of the flakes being searched for is expected to be negative. In this system, contrast is defined to be positive when a flake is slightly darker than the background. If the material being scanned is brighter than the background, this parameter should be specified."
			}
		},
		{
			"names" : ["-tr", "--threshold-ratio"],
			"spec"  : {
				"dest"     : "threshold_ratio",
				"type"     : "float",
				"default"  : 0.01,
				"help"     : "This is the minimum ratio of area containing flakes to area not containing flakes in a region necessary for it to be labelled a region of interest and scanned carefully."
			}
		},
		{
			"names" : ["-ct", "--contrast-threshold"],
			"spec"  : {
				"dest"     : "contrast_threshold",
				"type"     : "float",
				"default"  : 0.03,
				"help"     : "When determining whether or not a region should be scanned in more detail, pixels with contrast lower than this value will be set to zero and not considered."
			}
		},
		{
			"names" : ["-ap", "--autofocus-parameters"],
			"spec"  : {
				"dest"     : "autofocus_parameters",
				"nargs"    : 3,
				"type"     : "int",
				"default"  : [100, 1, 3],
				"help"     : "Additional parameters provided to the autofocus function. See MicroscopeControl.py -> MicroscopeController.autoFocus for details. The three values provided for this argument will be used as ndiv, passes and navg arguments. The 'passes' argument in particular can be useful for finding a good focus."
			}
		},
		{
			"names" : ["-mfe", "--max-focus-error"],
			"spec"  : {
				"dest"     : "max_focus_error",
				"type"     : "float",
				"default"  : 0.002,
				"help"     : "This is the maximume root mean squared error that the autofocus is allowed to have when approximating the focus as being linearly related to coordinates. If the error is higher than this the program will stop running before performing a full scan and print an error message."
			}
		},
	]
}